# ZoneServiceTypeParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ZoneServiceTypeParam Property
ParameterTypeId Class See Also
---
"Service Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ZoneServiceTypeParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZoneServiceTypeParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ZoneServiceTypeParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace